# Occupation

### Introduction:

Special thanks to: https://github.com/justmarkham for sharing the dataset and materials.

### Step 1. Import the necessary libraries

In [1]:
import pandas as pd

### Step 2. Import the dataset from this [address](https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user).

### Step 3. Assign it to a variable called users.

In [3]:
users=pd.read_csv("https://raw.githubusercontent.com/justmarkham/DAT8/master/data/u.user",sep='|')
users.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

### Step 4. Discover what is the mean age per occupation

In [4]:
users.groupby('occupation')['age'].mean()

occupation
administrator    38.746835
artist           31.392857
doctor           43.571429
educator         42.010526
engineer         36.388060
entertainment    29.222222
executive        38.718750
healthcare       41.562500
homemaker        32.571429
lawyer           36.750000
librarian        40.000000
marketing        37.615385
none             26.555556
other            34.523810
programmer       33.121212
retired          63.071429
salesman         35.666667
scientist        35.548387
student          22.081633
technician       33.148148
writer           36.311111
Name: age, dtype: float64

### Step 5. Discover the Male ratio per occupation and sort it from the most to the least

In [25]:
def gender_dec(x):
    if (x=='M'):
        return 1
    else:
        return 0
users['gender_dec']=users['gender'].apply(gender_dec)
b=users.groupby('occupation')['gender_dec'].sum()/users.occupation.value_counts()*100
b.sort_values(ascending=False)

doctor           100.000000
engineer          97.014925
technician        96.296296
retired           92.857143
programmer        90.909091
executive         90.625000
scientist         90.322581
entertainment     88.888889
lawyer            83.333333
salesman          75.000000
educator          72.631579
student           69.387755
other             65.714286
marketing         61.538462
writer            57.777778
none              55.555556
administrator     54.430380
artist            53.571429
librarian         43.137255
healthcare        31.250000
homemaker         14.285714
dtype: float64

### Step 6. For each occupation, calculate the minimum and maximum ages

In [28]:
users.groupby("occupation").age.agg(['max','min'])

               max  min
occupation
administrator   70   21
artist          48   19
doctor          64   28
educator        63   23
engineer        70   22
entertainment   50   15
executive       69   22
healthcare      62   22
homemaker       50   20
lawyer          53   21
librarian       69   23
marketing       55   24
none            55   11
other           64   13
programmer      63   20
retired         73   51
salesman        66   18
scientist       55   23
student         42    7
technician      55   21
writer          60   18

### Step 7. For each combination of occupation and gender, calculate the mean age

### Step 8.  For each occupation present the percentage of women and men

In [52]:
def gender_dec(x):
    if (x=='M'):
        return 1
    else:
        return 0
a=users
users['gender_dec']=users['gender'].apply(gender_dec)
b=users.groupby('occupation')['gender_dec'].sum()/users.occupation.value_counts()*100
c=100-b
users=users.set_index(a.index)
users['male']=b
users['female']=c
users[['occupation','male','female']]

        occupation  male  female
0       technician   NaN     NaN
1            other   NaN     NaN
2           writer   NaN     NaN
3       technician   NaN     NaN
4            other   NaN     NaN
5        executive   NaN     NaN
6    administrator   NaN     NaN
7    administrator   NaN     NaN
8          student   NaN     NaN
9           lawyer   NaN     NaN
10           other   NaN     NaN
11           other   NaN     NaN
12        educator   NaN     NaN
13       scientist   NaN     NaN
14        educator   NaN     NaN
15   entertainment   NaN     NaN
16      programmer   NaN     NaN
17           other   NaN     NaN
18       librarian   NaN     NaN
19       homemaker   NaN     NaN
20          writer   NaN     NaN
21          writer   NaN     NaN
22          artist   NaN     NaN
23          artist   NaN     NaN
24        engineer   NaN     NaN
25        engineer   NaN     NaN
26       librarian   NaN     NaN
27          writer   NaN     NaN
28      programmer   NaN     NaN
29         student   NaN     NaN
..             ...   ...     ...
913          other   NaN     NaN
914  entertainment   NaN     NaN
915       engineer   NaN     NaN
916        student   NaN     NaN
917      scientist   NaN     NaN
918          other   NaN     NaN
919         artist   NaN     NaN
920        student   NaN     NaN
921  administrator   NaN     NaN
922        student   NaN     NaN
923          other   NaN     NaN
924       salesman   NaN     NaN
925  entertainment   NaN     NaN
926     programmer   NaN     NaN
927        student   NaN     NaN
928      scientist   NaN     NaN
929      scientist   NaN     NaN
930       educator   NaN     NaN
931       educator   NaN     NaN
932        student   NaN     NaN
933       engineer   NaN     NaN
934         doctor   NaN     NaN
935          other   NaN     NaN
936       educator   NaN     NaN
937     technician   NaN     NaN
938        student   NaN     NaN
939  administrator   NaN     NaN
940        student   NaN     NaN
941      librarian   NaN     NaN
942        student   NaN     NaN

[943 rows x 3 columns]